{"class_name": "Model", "keras_version": "1.2.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 29], "input_dtype": "int32", "sparse": false, "name": "phrases"}, "inbound_nodes": [], "name": "phrases"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 37249, "batch_input_shape": [null, 29], "W_regularizer": null, "dropout": 0.0, "output_dim": 300, "input_length": 29}, "inbound_nodes": [[["phrases", 0, 0]]], "name": "embedding_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "convolution1d_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "convolution1d_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "activation_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_3"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "globalmaxpooling1d_1"}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "globalmaxpooling1d_1"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "globalmaxpooling1d_2"}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "globalmaxpooling1d_2"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "globalmaxpooling1d_3"}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "globalmaxpooling1d_3"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["globalmaxpooling1d_1", 0, 0], ["globalmaxpooling1d_2", 0, 0], ["globalmaxpooling1d_3", 0, 0]]], "name": "merge_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "main", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 600, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 2}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "main"}], "input_layers": [["phrases", 0, 0]], "output_layers": [["main", 0, 0]], "name": "model_1"}}