{"class_name": "Model", "keras_version": "1.2.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 29], "input_dtype": "int32", "sparse": false, "name": "phrases_1"}, "inbound_nodes": [], "name": "phrases_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 29], "input_dtype": "int32", "sparse": false, "name": "phrases_2"}, "inbound_nodes": [], "name": "phrases_2"}, {"class_name": "Embedding", "config": {"trainable": false, "name": "embedding_1_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 37249, "batch_input_shape": [null, 29], "W_regularizer": null, "dropout": 0.0, "output_dim": 300, "input_length": 29}, "inbound_nodes": [[["phrases_1", 0, 0]]], "name": "embedding_1_1"}, {"class_name": "Embedding", "config": {"trainable": false, "name": "embedding_1_2", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 37249, "batch_input_shape": [null, 29], "W_regularizer": null, "dropout": 0.0, "output_dim": 300, "input_length": 29}, "inbound_nodes": [[["phrases_2", 0, 0]]], "name": "embedding_1_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1_1", "activity_regularizer": null, "trainable": false, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1_1", 0, 0]]], "name": "convolution1d_1_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2_1", "activity_regularizer": null, "trainable": false, "filter_length": 4, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1_1", 0, 0]]], "name": "convolution1d_2_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3_1", "activity_regularizer": null, "trainable": false, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1_1", 0, 0]]], "name": "convolution1d_3_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1_2", "activity_regularizer": null, "trainable": false, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1_2", 0, 0]]], "name": "convolution1d_1_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2_2", "activity_regularizer": null, "trainable": false, "filter_length": 4, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1_2", 0, 0]]], "name": "convolution1d_2_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3_2", "activity_regularizer": null, "trainable": false, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": 29}, "inbound_nodes": [[["embedding_1_2", 0, 0]]], "name": "convolution1d_3_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_1_1"}, "inbound_nodes": [[["convolution1d_1_1", 0, 0]]], "name": "activation_1_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_2_1"}, "inbound_nodes": [[["convolution1d_2_1", 0, 0]]], "name": "activation_2_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_3_1"}, "inbound_nodes": [[["convolution1d_3_1", 0, 0]]], "name": "activation_3_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_1_2"}, "inbound_nodes": [[["convolution1d_1_2", 0, 0]]], "name": "activation_1_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_2_2"}, "inbound_nodes": [[["convolution1d_2_2", 0, 0]]], "name": "activation_2_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_3_2"}, "inbound_nodes": [[["convolution1d_3_2", 0, 0]]], "name": "activation_3_2"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": false, "name": "globalmaxpooling1d_1_1"}, "inbound_nodes": [[["activation_1_1", 0, 0]]], "name": "globalmaxpooling1d_1_1"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": false, "name": "globalmaxpooling1d_2_1"}, "inbound_nodes": [[["activation_2_1", 0, 0]]], "name": "globalmaxpooling1d_2_1"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": false, "name": "globalmaxpooling1d_3_1"}, "inbound_nodes": [[["activation_3_1", 0, 0]]], "name": "globalmaxpooling1d_3_1"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": false, "name": "globalmaxpooling1d_1_2"}, "inbound_nodes": [[["activation_1_2", 0, 0]]], "name": "globalmaxpooling1d_1_2"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": false, "name": "globalmaxpooling1d_2_2"}, "inbound_nodes": [[["activation_2_2", 0, 0]]], "name": "globalmaxpooling1d_2_2"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": false, "name": "globalmaxpooling1d_3_2"}, "inbound_nodes": [[["activation_3_2", 0, 0]]], "name": "globalmaxpooling1d_3_2"}, {"class_name": "Merge", "config": {"name": "merge_1_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["globalmaxpooling1d_1_1", 0, 0], ["globalmaxpooling1d_2_1", 0, 0], ["globalmaxpooling1d_3_1", 0, 0]]], "name": "merge_1_1"}, {"class_name": "Merge", "config": {"name": "merge_1_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["globalmaxpooling1d_1_2", 0, 0], ["globalmaxpooling1d_2_2", 0, 0], ["globalmaxpooling1d_3_2", 0, 0]]], "name": "merge_1_2"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": false, "name": "dropout_1_1"}, "inbound_nodes": [[["merge_1_1", 0, 0]]], "name": "dropout_1_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": false, "name": "dropout_1_2"}, "inbound_nodes": [[["merge_1_2", 0, 0]]], "name": "dropout_1_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1_1", "output_dim": 512, "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 600, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 600]}, "inbound_nodes": [[["dropout_1_1", 0, 0]]], "name": "dense_1_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1_2", "output_dim": 512, "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 600, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 600]}, "inbound_nodes": [[["dropout_1_2", 0, 0]]], "name": "dense_1_2"}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": false, "name": "dropout_2_1"}, "inbound_nodes": [[["dense_1_1", 0, 0]]], "name": "dropout_2_1"}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": false, "name": "dropout_2_2"}, "inbound_nodes": [[["dense_1_2", 0, 0]]], "name": "dropout_2_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2_1", "output_dim": 512, "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 512]}, "inbound_nodes": [[["dropout_2_1", 0, 0]]], "name": "dense_2_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2_2", "output_dim": 512, "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 512]}, "inbound_nodes": [[["dropout_2_2", 0, 0]]], "name": "dense_2_2"}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": false, "name": "dropout_3_1"}, "inbound_nodes": [[["dense_2_1", 0, 0]]], "name": "dropout_3_1"}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": false, "name": "dropout_3_2"}, "inbound_nodes": [[["dense_2_2", 0, 0]]], "name": "dropout_3_2"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_3_1", 0, 0], ["dropout_3_2", 0, 0]]], "name": "merge_6"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 512}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "dense_6"}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["dense_6", 0, 0]]], "name": "dropout_6"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "agregated_softmax", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 4}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "agregated_softmax"}], "input_layers": [["phrases_1", 0, 0], ["phrases_2", 0, 0]], "output_layers": [["agregated_softmax", 0, 0]], "name": "model_6"}}