{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 300, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 200, "activation": "relu", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "batch_input_shape": [null, 29, 300, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [26, 1], "strides": [26, 1], "border_mode": "valid"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 300, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 200, "activation": "relu", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "batch_input_shape": [null, 29, 300, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [26, 1], "strides": [26, 1], "border_mode": "valid"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 300, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 200, "activation": "relu", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "batch_input_shape": [null, 29, 300, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "pool_size": [25, 1], "strides": [25, 1], "border_mode": "valid"}}]}], "name": "merge_1", "concat_axis": 2, "arguments": {}, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "mode": "concat"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 600, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 2}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}